#[test]
fn test1_1(){
    fn main() {
        let i = 3;  // Тривалість життя `i` — від початку до кінця функції `main`.

        {  // Внутрішній блок для `borrow1`
            let borrow1 = &i;  // Тривалість життя `borrow1` починається тут.
            // Тривалість життя `borrow1` обмежена кінцем цього блоку.
            println!("borrow1: {}", borrow1);  // Виведення значення `borrow1`.
        }  // Тривалість життя `borrow1` завершується тут.

        {  // Внутрішній блок для `borrow2`
            let borrow2 = &i;  // Тривалість життя `borrow2` починається тут.
            // Тривалість життя `borrow2` обмежена кінцем цього блоку.
            println!("borrow2: {}", borrow2);  // Виведення значення `borrow2`.
        }  // Тривалість життя `borrow2` завершується тут.

    }  // Тривалість життя `i` завершується тут. Тривалість життя `i` — вся функція `main`.

}

#[test]
fn test1_2(){

}

#[test]
fn test1_3(){

}

#[test]
fn test1_4(){

}

#[test]
fn test1_5(){

}

#[test]
fn test1_6(){

}

#[test]
fn test1_7(){

}

#[test]
fn test1_8(){

}

#[test]
fn test1_9(){

}

#[test]
fn test1_10(){

